brewApp.controller('MainCntrl', function ($scope, $http, $location) {
    
    console.log('MainCntrl controller');
    $scope.top_links = [
        {
            img: 'http://www.hdwallpaperscool.com/wp-content/uploads/2014/05/obsidian-stout-beer-wallpaper.jpg',
            url: '',
            title: 'משלוח עד הבית',
            description: 'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק לרטי. קוואזי במר מודוף.אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח.לת צשחמי צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק.',
        },
        {
            img: 'http://hdwallpapersfit.com/wp-content/uploads/2015/04/beers_close-up_beer_desktop_1920x1200_hd-wallpaper-775916.jpg',
            url: '',
            title: 'התחל לבשל עוד היום',
            description: 'בירה ביתית היא תחביב מדבק ומתגמל. לאחר שתתחיל להכין בירה ביתית תגלה שטעמה ' +
                        'של בירה מסחרית שאהבת פתאום לא מספק אותך כמו קודם.כמו שלכל בית יש את התבשיל ' +
                        'המיוחד שלו , כך מתכון חדש יתווסף למתכוני הבית, הפעם בירה ביתית , רק שאותו יהיה ' +
                        'אפשר למצוא רק אצלך.החברים והמשפחה ישמחו לגלות את התחביב החדש שלך ואפילו ' +
                        'לבדוק את התוצרת מקרוב.',
        },
        {
            img: 'http://www.stonerdays.com/wp-content/uploads/2014/03/dsc_1165.jpg',
            url: '',
            title: 'סגולותיה של הכשות',
            description: "צמח הכשות , הומולוס לופולוס בלטינית , ידוע בעיקר בזכות שימושו בבישול בירה. אך ידועה פחות העובדה שיש לו שימושים נוספים , רפואיים וטיפוליים. למעשה יש תיעוד נרחב של שימוש בצמח הכשות לצרכים רפואיים במשך מאות שנים. למשל הכנה של תרופות מסורתיות בצפון אמריקה או בהודו. גם באנגליה ידעו על יתרונותיה הרפואיים של צמח הכשות בזמנו , אחד האנשים המוכרים שטופלו באמצעות כשות הוא המלך ג'ורג' השלישי. מאמינים שהוא ישן על כריות שמולאו בפרחי כשות על מנת להרגיעו." +
                        "מחקרים מצאו כי לכשות יש תכונות מרגיעות אשר מקדמות שינה ורוגע , בדרך כלל ללא תופעות לוואי , לרכיבים הנמצאים בכשות יש איכויות שונות הכוללות: שיכוך כאבים, ניקוי הגוף מבקטריות, טיפול בנדודי שינה ובעיות הקשורות במערכת העצבים.בשל איכויות אלו ישנם מוצרים רפואיים רבים בשוק אשר מכילים כשות ומיצויי כשות כרכיב פעיל.מחקרים נוספים ממשיכים להתקיים ולחפש יתרונות קליניים מוכחים בטיפול במחלות , נוגדי סרטן ועוד.",
        },
        {
            img: 'http://www.hd-wallpapers9.com/gallery/Hd/Beer%20Desktop%20Wallpapers/Beer%20Desktop%20Wallpapers-016.jpg',
            url: '',
            title: 'בשלן החודש',
            description: 'לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק לרטי. קוואזי במר מודוף.אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח.לת צשחמי צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק.',
            
        },
    ];

    $scope.newsletter = {
        value: '',
        isUsed: false,
        placeholder:'הכנס אימייל',
    }
    
}).controller('HowToCntrl', function ($scope, $http, $location) {
    
    console.log('HowToCntrl controller');
    
});

